tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "mas-cli/tap"
tap "railwaycat/emacsmacport"
brew "gnupg"
brew "pinentry-mac"
brew "mas"
brew "ca-certificates"
brew "openssl"
brew "aspell"
brew "autoconf"
brew "readline"
brew "sqlite"
brew "python"
brew "autojump"
brew "automake"
brew "bash-completion"
brew "bat"
brew "binutils"
brew "pkg-config"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "curl"
brew "dbus"
brew "dos2unix"
brew "doxygen"
brew "editorconfig"
brew "exa"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "libtool"
brew "p11-kit"
brew "gnutls"
brew "libgpg-error"
brew "libgcrypt"
brew "go"
brew "golangci-lint"
brew "grep"
brew "hopenpgp-tools"
brew "ncurses"
brew "htop"
brew "hunspell"
brew "imagemagick"
brew "libpcap"
brew "libvterm"
brew "libyubikey"
brew "llvm"
brew "make"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "node"
brew "tree"
brew "pass"
brew "perl"
brew "ripgrep"
brew "ruby"
brew "sfml"
brew "shellcheck"
brew "shfmt"
brew "svn"
brew "telnet"
brew "texinfo"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "unar"
brew "unzip"
brew "w3m"
brew "wget"
brew "wordnet"
brew "ykman"
brew "ykpers"
brew "zip"
brew "zsh"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-imagemagick", "with-mac-metal", "with-modern-icon", "with-natural-title-bar"]
cask "alacritty"
cask "appcleaner", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "dropbox", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-dejavu"
cask "font-ibm-plex-mono"
cask "font-jetbrains-mono"
cask "font-juliamono"
cask "font-overpass"
cask "font-source-code-pro", args: { appdir: "/Applications" }
cask "docker"
cask "mactex"
cask "mullvadvpn"
cask "skype", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "the-unarchiver", args: { appdir: "/Applications" }
cask "transmission", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "wireshark", args: { appdir: "/Applications" }
# mas "Amphetamine", id: 937984704
# mas "Magnet", id: 441258766
# mas "Numbers", id: 409203825
# mas "Telegram", id: 747648890
# mas "Twitter", id: 1482454543
# mas "WhatsApp", id: 1147396723
